[
    {
        "id": "2026-02-14-1",
        "version": "1.6.0",
        "title": "What’s New in Version 1.6.0",
        "publishedAt": "2026-02-14T00:00:00Z",
        "isSignificant": true,
        "chapters": [
            {
                "id": "1",
                "title": "■ Added Filter Layer Feature (Non-destructive Adjustment Layers)",
                "body": "Added a filter layer feature that allows you to apply filters to the composite result of layers below. You can add it by tapping the filter icon in the layer panel and selecting the 'Create Filter Layer' menu.\nThe application range of filter layers can be controlled using clipping masks and folders. When you set clipping on a filter layer, the filter is applied to the content of the layer directly below it. When a filter layer is placed inside a folder, the filter is applied to the composite result of all layers below it within that folder.\nThe image below shows an example where a 'Hue, Saturation, Lightness' filter layer is placed above three layers containing pure red, green, and blue colors, with contrast and saturation reduced.",
                "imageURL": "https://arcturu.com/micapaint/resources/updates-1.6.0-filter-layer.webp"
            },
            {
                "id": "2",
                "title": "■ Added Dither Filter",
                "body": "Added a dither filter that binarizes based on color or transparency.\nIn 'Mode', you can choose between 'RGBA' which dithers all channels, and 'Alpha Only' which dithers only the alpha channel.\n'Threshold' allows you to adjust the dithering threshold.\n'Dot Size' allows you to adjust the size of the dither pattern dots.\nThe image below shows an example of a gradient drawn with a brush (top) and the result after copying it and applying a dither filter (bottom).",
                "imageURL": "https://arcturu.com/micapaint/resources/updates-1.6.0-dither.webp"
            },
            {
                "id": "3",
                "title": "■ Added Layer Folder Creation Button",
                "body": "Added an “Add Folder” button to the menu opened from the ... in the layer panel. Previously, folders could only be created by dragging a layer onto another layer. This update allows you to create folders explicitly."
            },
            {
                "id": "4",
                "title": "■ Improved Stability",
                "body": "・Improved compatibility of exported PSD files\n・Faster PSD export\n・Fixed an issue where colors drawn with Lasso Fill / Slime Brush were not added to the color history\n・Fixed an issue where numbers in the UI would jitter when changing\n・Fixed an issue where brush rotation was applied in the opposite direction while the canvas was flipped\n・Additional bug fixes"
            }
        ]
    },
    {
        "id": "2026-01-20-1",
        "version": "1.5.0",
        "title": "What's New in Version 1.5.0",
        "publishedAt": "2026-01-20T00:00:00Z",
        "isSignificant": true,
        "chapters": [
            {
                "id": "1",
                "title": "■ Added Color History and Swatches",
                "body": "Added color history and swatches to the color picker. Tap each cell to select it. Long press a cell in the swatches (second row) to overwrite it with the current color. You can toggle the display of color history and swatches in the settings.",
                "imageURL": "https://arcturu.com/micapaint/resources/updates-1.5.0-color-history-and-swatch.webp"
            }
        ]
    },
    {
        "id": "2026-01-15-1",
        "version": "1.4.0",
        "title": "What's New in Version 1.4.0",
        "publishedAt": "2026-01-15T00:00:00Z",
        "isSignificant": true,
        "chapters": [
            {
                "id": "1",
                "title": "■ Added Liquify Tool",
                "body": "Added a liquify tool that lets you transform layers by dragging across them. It supports Push, Scale, Rotate, and Reset modes. If you're using Apple Pencil Pro, you can also control rotation by rolling the pencil in Push mode. Use the Softness parameter to adjust the smoothness of transformation edges and the Strength parameter to adjust the amount of deformation.",
                "imageURL": "https://arcturu.com/micapaint/resources/updates-1.4.0-liquify.webp"
            },
            {
                "id": "2",
                "title": "■ PSD File Export Support",
                "body": "You can now select PSD from the export menu. Edit the file in other tools while preserving the layer structure.",
                "imageURL": "https://arcturu.com/micapaint/resources/updates-1.4.0-export-psd.webp"
            },
            {
                "id": "3",
                "title": "■ PSD File Import Support",
                "body": "You can now import and edit PSD files from the Files app or camera roll. Select Micapaint from the share destination in the File menu.",
                "imageURL": "https://arcturu.com/micapaint/resources/updates-1.4.0-import-psd.webp"
            },
            {
                "id": "4",
                "title": "■ iPadOS 26 Design Support",
                "body": "Tool UI now supports iPadOS 26 design. Fixed UI issues such as the back to gallery button being hidden by window controls."
            },
            {
                "id": "5",
                "title": "■ Improved Stability",
                "body": "・Fixed an issue where the topmost item was always deleted when pressing the localization delete button for brush names\n・Fixed layout corruption when reducing sidebar width\n・Additional bug fixes"
            }
        ]
    },
    {
        "id": "2025-11-27-1",
        "version": "1.3.1",
        "title": "What's New in Version 1.3.1",
        "publishedAt": "2025-11-27T00:00:00Z",
        "isSignificant": true,
        "chapters": [
            {
                "id": "1",
                "title": "■ Fixed an issue where image importing failed",
                "body": "Fixed an issue in v1.3.0 where importing an image into a layer caused an error."
            }
        ]
    },
    {
        "id": "2025-11-21-1",
        "version": "1.3.0",
        "title": "What's New in Version 1.3.0",
        "publishedAt": "2025-11-21T00:00:00Z",
        "isSignificant": true,
        "chapters": [
            {
                "id": "1",
                "title": "■ Explicitly Save Canvas",
                "body": "Added an option to save without returning when pressing the back to gallery button. When you turn ON 'Always Save and Back to Gallery', it behaves like before.",
                "imageURL": "https://arcturu.com/micapaint/resources/updates-1.3.0-save.gif"
            },
            {
                "id": "2",
                "title": "■ Layer Rotation & Flip Features",
                "body": "Added buttons to rotate and flip layers in the Transform tool's operation panel.",
                "imageURL": "https://arcturu.com/micapaint/resources/updates-1.3.0-rotate-flip-layer.webp"
            },
            {
                "id": "3",
                "title": "■ Improved Stability",
                "body": "・Fixed canvas not being saved when returning to gallery page during filter editing\n・Fixed layer content corruption when performing other layer operations during filter editing\n・Fixed alpha lock not working on slime brush\n・Additional bug fixes"
            }
        ]
    },
    {
        "id": "2025-11-08-1",
        "version": "1.2.0",
        "title": "What's New in Version 1.2.0",
        "publishedAt": "2025-11-08T00:00:00Z",
        "isSignificant": true,
        "chapters": [
            {
                "id": "1",
                "title": "■ Maintain Brightness While Adjusting Saturation",
                "body": "In the Hue / Saturation / Brightness filter, switching to Perceptual mode now lets you adjust saturation while keeping the original brightness.",
                "imageURL": "https://arcturu.com/micapaint/resources/updates-1.2.0-perceptual.webp",
                "imageCaption": "Original / Perceptual Saturation -100 / Compatible Mode Saturation -100"
            },
            {
                "id": "2",
                "title": "■ Create a Layer Merged from All Layers",
                "body": "Tap Add Merged Layer from the layer menu to insert a layer above the current one that contains a merge of all layers.",
                "imageURL": "https://arcturu.com/micapaint/resources/updates-1.2.0-merge.gif"
            },
            {
                "id": "3",
                "title": "■ Swipe Left on Layers to Delete",
                "body": "Swiping left on a layer or folder now reveals the Delete button.",
                "imageURL": "https://arcturu.com/micapaint/resources/updates-1.2.0-delete.gif"
            },
            {
                "id": "4",
                "title": "■ Show Tooltips",
                "body": "Hover Apple Pencil over a button to see a description (requires a device that supports hover)."
            },
            {
                "id": "5",
                "title": "■ Improved Stability",
                "body": "・Fixed hue values occasionally jumping in the color picker\n・Undo / Redo availability now reflected in the button appearance\n・Additional bug fixes"
            }
        ]
    }
]